Tekla.Structures.Drawing.CannotDeleteActiveDrawingException
The CannotDeleteActiveDrawingException class defines the exception
that is thrown when a user tries to delete a drawing
that is active.

Tekla.Structures.Drawing.CannotDeleteActiveDrawingException.#ctor(System.String)
Creates a new cannot delete active drawing exception instance.
Message: The exception message.

Tekla.Structures.Drawing.CannotDeleteActiveDrawingException.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Initializes a new instance with serialized data.
info: The object that holds the serialized object data.
context: The contextual information about the source or destination.